doom/config.org
#+title: Config
#+PROPERTY: header-args:emacs-lisp :tangle config.el

* Basic configurations
** Default directory
#+begin_src emacs-lisp
(setq org-directory "~/org/")
#+end_src

** Line number
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src

** Themes
#+begin_src emacs-lisp
(setq doom-theme 'doom-one)
;; (setq doom-theme 'doom-one-light)
#+end_src

** Font
#+begin_src emacs-lisp
;;(setq doom-font (font-spec :family "Fira Code" :size 13))
(setq doom-font (font-spec :family "Hack" :size 13))
#+end_src

* Org
** Org roam
*** Configuration
#+begin_src emacs-lisp
(use-package! org-roam
              :custom
              (org-roam-directory (file-truename "~/org/"))
              :config
              (org-roam-db-autosync-mode)
              (map! :leader
                   (:prefix ("r" . nil)
                    :desc "Org roam capture"                "c"   #'org-roam-capture
                    :desc "Org roam insert node"            "i"  #'org-roam-node-insert
                    :desc "Org roam find node"              "f"  #'org-roam-node-find
                    :desc "Org roam UI"                     "g"  #'org-roam-ui-mode
                    :desc "Org roan dailies goto today"     "t" #'org-roam-dailies-capture-today
                    :desc "Org roam dailies goto tomorrow"  "T" #'org-roam-dailies-goto-tomorrow
                    :desc "Org roam dailies goto yesterday" "y" #'org-roam-dailies-goto-yesterday)))
(use-package org-roam-dailies
             :after org-roam
             :config
             (setq org-roam-dailies-directory "roam/dailies/"))
#+end_src

*** Templates
#+begin_src emacs-lisp
(setq org-roam-capture-templates
      '(("n" "note" plain "%?"
         :target (file+head "${slug}.org"
                            "#+title: ${title}\n#+created: %U\n#+filetags: \n")
         :unnarrowed t)))

(setq org-roam-dailies-capture-templates
      '(("d" "dailies" entry "* %U %?"
         :target (file+head "%<%Y-%m-%d>.org"
                            "#+title: %<%Y-%m-%d>\n"))))
#+end_src

*** Org roam ui
#+begin_src emacs-lisp
(use-package! org-roam-ui
              :after org-roam
              :hook (org-roam-mode . org-roam-ui-mode)
              :config
              (setq org-roam-ui-sync-theme t
                   org-roam-ui-follow t
                    org-roam-ui-update-on-save t
                    org-roam-ui-open-on-start t))
#+end_src

** Org agenda
*** Configuration
#+begin_src emacs-lisp
(setq org-agenda-files
      (directory-files-recursively "~/org/" "\\.org$"))

(setq org-agenda-skip-scheduled-if-done t
      org-agenda-skip-deadline-if-done t)
#+end_src

*** Keybindings
#+begin_src emacs-lisp
(map! :leader
      :desc "org-agenda" "a" #'org-agenda)
#+end_src
*** Sort
#+begin_src emacs-lisp
(setq org-agenda-sorting-strategy
      '((tags tag-up)))
#+end_src

** Org capture
*** Keybindings
#+begin_src emacs-lisp
(map! :leader
      :desc "org-capture" "c" #'org-capture)
#+end_src

*** Templates
#+begin_src emacs-lisp
(after! org
  (setq org-capture-templates
        '(
          ("t" "tasks" entry
           (file "~/org/tasks.org")
           "* TODO %U %? :todos:\n")

          ("i" "ideas" entry
           (file "~/org/ideas.org")
           "* IDEA %U %? :ideas:\n")

          ("n" "notes" entry
           (file "~/org/notes.org")
           "* NOTE %U %? :notes:\n"))))

;;          ("j" "journal")
;;          ("jr" "reflections" entry
;;           (file+olp+datetree "~/org/journal.org")
;;           "* %U Reflection %? :reflections:\n")
;;          ("jo" "observations" entry
;;           (file+olp+datetree "~/org/journal.org")
;;           "* %U %? :observations:\n")
#+end_src

** Org todo keywords
#+begin_src emacs-lisp
(after! org
  (setq org-todo-keywords
        '((sequence
           "TODO(t)"
           "PROJ(p)"
           "LOOP(l)"
           "STRT(s)"
           "WAIT(w)"
           "HOLD(h)"
           "IDEA(i)"
           "NOTE(n)"
           "|"
           "DONE(d)"
           "KILL(k)"
           "ARCH(a)"
           "PROC(P)"))))
#+end_src
* Misc.
** Vim bindings
#+begin_src emacs-lisp
(setq evil-escape-key-sequence "jk")
(setq evil-escape-delay 0.2)
#+end_src

** Hunspell
#+begin_src emacs-lisp
(setq ispell-program-name "hunspell")

(setq ispell-hunspell-dict-paths-alist
      '(("en_US" "C:/Hunspell/dict/en_US.aff")))

(setq ispell-local-dictionary "en_US")
#+end_src

** Bin
#+begin_src emacs-lisp
(setq delete-by-moving-to-trash t)
#+end_src

** Confirm exist
#+begin_src emacs-lisp
(setq confirm-kill-emacs nil)
#+end_src

** Initial buffer
#+begin_src emacs-lisp
(setq initial-buffer-choice "~/org/")
#+end_src
